app/views/books/index.html.erb

SELECT "books".* FROM "books"
---
      <td><%= book.body %></td>
      <td><%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %></td>