app/controllers/books_controller.rb

SELECT "users".* FROM "users"
SELECT "books".* FROM "books"
---
	def new
        @user = current_user
        @users = User.all
		@book = Book.new
        @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def show
        @user = current_user
        @new_book = Book.new
        @book = Book.find(params[:id])