app/controllers/books_controller.rb

    def index
        @user = current_user
        @users = User.all
		@book = Book.new
        @books = Book.all
---
SELECT "books".* FROM "books"