app/controllers/users_controller.rb

  def index
  	@book = Book.new
  	@user= current_user
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
  	@user= current_user
  	@book = Book.new
  	@user = User.find(params[:id])
  	@books = @user.books.page(params[:page]).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 25], ["OFFSET", 0]]

  def edit
  	@book = Book.new
  	@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]